In [3]:
import pandas as pd
from pandas import Series, DataFrame

In [11]:
data = [4, 7, -5, 3]
index = ["한남", "대학", "평생", "학습"]
pd_data=pd.Series(data)
pd_data2 = pd.Series(data, index)
print(pd_data2)
print(pd_data2["대학"])

한남    4
대학    7
평생   -5
학습    3
dtype: int64
7

In [12]:
pd_data2[pd_data2>0]

한남    4
대학    7
학습    3
dtype: int64

In [13]:
"학습" in pd_data2   #내부에 어떤 데이터가 있는 지 알아보기

True

In [14]:
"빅데" in pd_data2

False

In [21]:
ser_data = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
index = ["california", "Ohio","Oregon", "Texas", "Utah"]
pd_data3 = pd.Series(ser_data)
pd_data3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
ser_data = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
index = ["California", "Ohio", "Oregon", "Utah"]
pd_data4 = pd.Series(ser_data, index)
pd_data4

California        NaN
Ohio          35000.0
Oregon        16000.0
Utah           5000.0
dtype: float64

In [20]:
pd.isnull(pd_data4)   #결측치 찾기

California     True
Ohio          False
Oregon        False
Utah          False
dtype: bool

In [22]:
pd.notnull(pd_data4)  #결측치 아닌것 찾기

California    False
Ohio           True
Oregon         True
Utah           True
dtype: bool

In [23]:
pd_data4.name = "population"

In [24]:
pd_data4.index.name = "state"

In [25]:
pd_data4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Utah           5000.0
Name: population, dtype: float64

데이터 프레임 만들기

In [27]:
data = {"state": ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
       "year": [2000,2001,2002,2001,2002,2003],
       "pop": [1.5,1.7,3.6,2.4,2.9,3.2]}
dframe1 = pd.DataFrame(data)
dframe1.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
dframe1.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
dframe2 = pd.DataFrame(data, columns=["year","state","sales","pop"],
                      index = ["No1","No2","No3","No4","No5","No6"])
dframe2

     year   state sales  pop
No1  2000    Ohio   NaN  1.5
No2  2001    Ohio   NaN  1.7
No3  2002    Ohio   NaN  3.6
No4  2001  Nevada   NaN  2.4
No5  2002  Nevada   NaN  2.9
No6  2003  Nevada   NaN  3.2

In [33]:
dframe2.pop

<bound method DataFrame.pop of    year   state sales  pop
0  2000    Ohio   NaN  1.5
1  2001    Ohio   NaN  1.7
2  2002    Ohio   NaN  3.6
3  2001  Nevada   NaN  2.4
4  2002  Nevada   NaN  2.9
5  2003  Nevada   NaN  3.2>

In [34]:
dframe2['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [38]:
dframe2.loc["No4"]

year       2001
state    Nevada
sales       NaN
pop         2.4
Name: No4, dtype: object

In [41]:
dframe2['sales'] = 0
dframe2

     year   state  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      0  1.7
No3  2002    Ohio      0  3.6
No4  2001  Nevada      0  2.4
No5  2002  Nevada      0  2.9
No6  2003  Nevada      0  3.2

In [46]:
import numpy as np

In [47]:
dframe2['sales'] = np.arange(6)
dframe2

     year   state  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      1  1.7
No3  2002    Ohio      2  3.6
No4  2001  Nevada      3  2.4
No5  2002  Nevada      4  2.9
No6  2003  Nevada      5  3.2

In [43]:
dframe2['sales']= [100,200,300,400,500,600]
dframe2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [54]:
#인덱스가 안들어가짐
ser = pd.Series([100,200,300,400,500,600])
ser   #0,1,2,3,4,5 index가지고 잇음

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [55]:
dframe2['sales']= ser
dframe2

     year   state  sales  pop
No1  2000    Ohio    NaN  1.5
No2  2001    Ohio    NaN  1.7
No3  2002    Ohio    NaN  3.6
No4  2001  Nevada    NaN  2.4
No5  2002  Nevada    NaN  2.9
No6  2003  Nevada    NaN  3.2

In [50]:
#인덱스 생성해서 넣음 (개수 맞아야함)
index = ["No1","No2","No3","No4","No5","No6"]
ser = pd.Series([100,200,300,400,500,600], index)
ser   #0,1,2,3,4,5 index가지고 잇음
dframe2['sales']= ser
dframe2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [58]:
index=['No1','No2',"No3","No4","No5","No6"]
ser = pd.Series([100,200,300,400,500,600],index)
dframe2['additional'] = ser
dframe2

     year   state  sales  pop  additional
No1  2000    Ohio    NaN  1.5         100
No2  2001    Ohio    NaN  1.7         200
No3  2002    Ohio    NaN  3.6         300
No4  2001  Nevada    NaN  2.4         400
No5  2002  Nevada    NaN  2.9         500
No6  2003  Nevada    NaN  3.2         600

In [59]:
del dframe2['additional']
dframe2

     year   state  sales  pop
No1  2000    Ohio    NaN  1.5
No2  2001    Ohio    NaN  1.7
No3  2002    Ohio    NaN  3.6
No4  2001  Nevada    NaN  2.4
No5  2002  Nevada    NaN  2.9
No6  2003  Nevada    NaN  3.2

In [ ]:
중첩된 데이터

In [61]:
pop_data = {
    'Nevada':{2001:2.4,2002:2.9},
    'Ohio': {2000:1.5,2001:1.7,2002:3.6}
}
dframe2 = pd.DataFrame(pop_data)
dframe2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
dframe2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [63]:
#인덱스추가, 인덱스 정렬
dframe2 = pd.DataFrame(pop_data, index = [2000,2001,2002,2003])
dframe2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [65]:
dframe2.index.name = 'year'
dframe2.columns.name = 'state'
dframe2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [66]:
dframe2.index

Int64Index([2000, 2001, 2002, 2003], dtype='int64', name='year')

In [68]:
dframe2.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [67]:
dframe2.values  #numpy array형태로 나옴 #pandas는 내부적으로 numpy사용

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6],
       [nan, nan]])

In [69]:
dframe2.index[2] = 2999

TypeError: Index does not support mutable operations

In [70]:
dframe2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [72]:
dframe3 = dframe2.reindex([2000,2001,2002,2003,2004])
dframe3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN
2004      NaN   NaN

In [74]:
df4 = pd.Series(['blue','puple','yellow'], index = [0,2,4])
print(df4)
df5 = df4.reindex(index=[0,1,2,3,4])  #없는 건 없다고 나옴
print(df5)

0      blue
2     puple
4    yellow
dtype: object
0      blue
1       NaN
2     puple
3       NaN
4    yellow
dtype: object

In [75]:
df4 = pd.Series(['blue','puple','yellow'], index = [0,2,4])
print(df4)
df5 = df4.reindex(index=[0,1,2,3,4], method='ffill')   #없는거 채움
print(df5)

0      blue
2     puple
4    yellow
dtype: object
0      blue
1      blue
2     puple
3     puple
4    yellow
dtype: object

In [76]:
df4 = pd.Series([100,300,500], index = [0,2,4])
print(df4)
df5 = df4.reindex(index=[0,1,2,3,4], method='ffill')   #없는거 이전꺼에서 가져와서 채움
print(df5)

0    100
2    300
4    500
dtype: int64
0    100
1    100
2    300
3    300
4    500
dtype: int64

In [78]:
df5= dframe2.reindex(columns=["네바다","오하이오"])
df5

state  네바다  오하이오
year
2000   NaN   NaN
2001   NaN   NaN
2002   NaN   NaN
2003   NaN   NaN

In [79]:
#새로운곳에서 삭제
new_df5 = df5.drop(2001)
new_df5

state  네바다  오하이오
year
2000   NaN   NaN
2002   NaN   NaN
2003   NaN   NaN